export const TABLE_HEADER = ["時", "日", "月", "年"];

export const HANJA_MAP: Record<string, string> = {
  십성: "十星",
  겁재: "劫財",
  비견: "比肩",
  편재: "偏財",
  정재: "正財",
  식신: "食神",
  상관: "傷官",
  정관: "正官",

  천간: "天干",
  갑: "甲",
  을: "乙",
  병: "丙",
  정: "丁",
  무: "戊",

  지지: "地支",
  인: "寅",
  묘: "卯",
  오: "午",
  사: "巳",
  신: "申",

  십이운성: "十二運星",
  장생: "長生",
  목욕: "沐浴",
  관대: "冠帶",
  건록: "建祿",
  제왕: "帝旺",

  십이신살: "十二神殺",
  천덕: "天德",
  월살: "月煞",
  장성: "將星",
  백호: "白虎",
  천을귀인: "天乙貴人",

  귀인: "貴人",
  천을: "天乙",
  지살: "地煞",
  문창: "文昌",
  천복: "天福",
  천귀: "天貴",
};

export const ELEMENTAL_COLOR: Record<string, string> = {
  화: "#C23030",
  목: "#18868C",
};

export const ELEMENTAL_MAP: Record<string, string> = {
  을: "목",
  갑: "목",
  병: "화",
  정: "화",
  묘: "목",
  인: "목",
  오: "화",
  사: "화",
};
